Revit 2027 API
BalusterPattern.GetBaluster Method
 Gets information about the given baluster from the main baluster pattern.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BalusterInfo GetBaluster(
	int index
)
Public Function GetBaluster (
	index As Integer
) As BalusterInfo
public:
BalusterInfo^ GetBaluster(
	int index
)
member GetBaluster :
        index : int -> BalusterInfo
Parameters
index Int32
 The baluster index.
Return Value
BalusterInfo
 The requested baluster or null if index is out of range.
See Also
Reference
BalusterPattern Class
Autodesk.Revit.DB.Architecture Namespace